Revit 2023 API
Rebar.DistributionType Property
 The type of rebar distribution(also known as Rebar Set Type).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2017
Syntax
C#
public DistributionType DistributionType { get; set; }
Visual Basic
Public Property DistributionType As DistributionType
	Get
	Set
Visual C++
public:
property DistributionType DistributionType {
	DistributionType get ();
	void set (DistributionType value);
}
Remarks
 The possible values of this property are:
Uniform
VaryingLength
 For a uniform distribution type: all bars parameters are the same as the first bar in set. For a varying length distribution type: bars parameters can vary(primarly in length) taking in consideration the constraints of the first bar in set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace